10V/10Angle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       159200;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       159400;
    }
    bottom
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          300;
        startFace       159800;
    }
    top
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          300;
        startFace       160100;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       160400;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          160000;
        startFace       160800;
    }
)

// ************************************************************************* //
